#!/usr/bin/env perl
BEGIN {
    if ( ! $ENV{AUTHOR_TESTING}) {
        require Test::More;
        Test::More::plan( skip_all => 'these tests requires AUTHOR_TESTING' );
    }
}

use Treex::Tool::SandhiHandler::TA 'combine';
use Test::More;
use utf8;

my @left = (
	'முதியோர்',          'முதியோர்',
	'நாய்',                      'நிற்பதை',
	'பேருந்துகள்', 'பயன்',
	'நிற்பது',             'சேர்',
	'தொகை',                      'விலைவாசி',
	'இரு',                         'புரிந்து',
	'உறுப்பினர்',    'காட்ட',
	'செய்து',                'நாளை',
	'பொருந்து',          'செய்து',
	'முடிவு',                'தொகை',
	'இருந்தால்',       'வசதியை',
	'இருப்போர்',       'கூறி',
	'என்பதை',                'அளவு',
	'சிறந்தது',          'வேண்டும்',
	'என்பதை',                'கருது',
	'தரு',                         'நலனில்',
	'மக்களாட்சி',
);
my @right = (
	'உக்கு',       'ுக்கு',
	'ஐ',                   'உம்',
	'இல்',             'அடைந்து',
	'ஐயும்',       'த்து',
	'இல்',             'க்கு',
	'க்கிறது', 'கொள்ளாமல்',
	'களின்',       'இல்லை',
	'உள்ளது',    'க்கு',
	'ஆதது',          'அதை',
	'ஆக',                'ஆக',
	'உம்',             'உம்',
	'க்கு',          'இருப்பதை',
	'ஏ',                   'ஐ',
	'ஆக',                'ஏ',
	'உம்',             'இ',
	'அ',                   'உம்',
	'ஓ',
);

my @expected = (
	'முதியோருக்கு',
	'முதியோருக்கு',
	'நாயை',
	'நிற்பதையும்',
	'பேருந்துகளில்',
	'பயனடைந்து',
	'நிற்பதையும்',
	'சேர்த்து',
	'தொகையில்',
	'விலைவாசிக்கு',
	'இருக்கிறது',
	'புரிந்துகொள்ளாமல்',
	'உறுப்பினர்களின்',
	'காட்டவில்லை',
	'செய்துள்ளது',
	'நாளைக்கு',
	'பொருந்தாதது',
	'செய்ததை',
	'முடிவாக',
	'தொகையாக',
	'இருந்தாலும்',
	'வசதியையும்',
	'இருப்போர்க்கு',
	'கூறியிருப்பதை',
	'என்பதையே',
	'அளவை',
	'சிறந்ததாக',
	'வேண்டுமே',
	'என்பதையும்',
	'கருதி',
	'தர',
	'நலனிலும்',
	'மக்களாட்சியோ',
);

foreach my $i ( 0 .. $#left ) {
	my $combined = combine( $left[$i], $right[$i] );
	ok( $combined eq $expected[$i], "$left[$i] + $right[$i] => $combined" );
}

done_testing();
